
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
		
	Если Параметры.Свойство("Список") Тогда
		Для Каждого Сч Из Параметры.Список Цикл
			Список.Добавить(Сч.Значение, Сч.Представление, ,БиблиотекаКартинок.ПерейтиВперед);
		КонецЦикла;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	АвтоЗаголовок = Ложь;
	Заголовок = КлючУникальности;	
	
КонецПроцедуры

&НаКлиенте
Процедура Выбрать(Команда)
	ОповеститьОВыборе(Элементы.Список.ТекущиеДанные);
КонецПроцедуры

&НаКлиенте
Процедура СписокВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	ОповеститьОВыборе(Элементы.Список.ТекущиеДанные);
КонецПроцедуры

