
&НаКлиенте
Процедура КМН_ОбработкаОповещенияПосле(ИмяСобытия, Параметр, Источник)
	
	Если ПоказыватьОбластьОбзора Тогда
		Если ИмяСобытия = "ДокументИзменен" И Параметр = ТекущийДокумент Тогда
			УстановитьОформлениеФормы();
		КонецЕсли;
	КонецЕсли;	

КонецПроцедуры

&НаКлиенте
Процедура КМН_СписокПриАктивизацииСтрокиВместо(Элемент)
	
	ОбновитьПараметрыУчетаВремениВФорме();
	
	Если ПоказыватьОбластьОбзора Тогда 
		ОбзорСпискаДокументовКлиент.ОбновитьМиникарточку(ЭтаФорма);
		УстановитьОформлениеФормы();
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура УстановитьОформлениеФормы()
	
	Если Не ЭтоКомандировка(ЭтаФорма.ТекущийДокумент) Тогда
		Возврат;
	КонецЕсли;
	
	ДопРеквизиты = Новый Массив;
	ДопРеквизиты.Добавить("ДанныеАвансовыйОтчетРасходы");
	ДопРеквизиты.Добавить("ДанныеАвансовыйОтчетДоходы");
	ДопРеквизиты.Добавить("ДанныеПутевыеЛисты");
	
	Для Каждого Стр Из ДопРеквизиты Цикл
		ЭтаФорма.ОбзорHTML = СтрЗаменить(ЭтаФорма.ОбзорHTML, Стр+":", "");
	КонецЦикла;	
	
	ЭтаФорма.ОбзорHTML = СтрЗаменить(ЭтаФорма.ОбзорHTML, "Товары и услуги", "Смета расходов");
	
	//Выведем данные путевых листов
		
	ТочкаВставки = Найти(ЭтаФорма.ОбзорHTML, "</body></html>");
	ПутевыеЛистыХТМЛ_Начало = "<FONT color=#413003>Путевые листы:</FONT><p>";
	ПутевыеЛистыХТМЛ_Конец = "</p>";
	ПутевыеЛистыХТМЛ_Тело = "";

	//т.к. данные таблиц хранятся в формате JSON, то ищем строки "[{...}]"
	МассДопДанные = ПолучитьДанныеСтроки("\[{.[^\]]*}\]", ЭтаФорма.ОбзорHTML);
	
	Для Каждого Стр Из МассДопДанные Цикл
		Если НЕ Найти(Стр, "&quot;Автомобиль&quot;")>0 Тогда
			ЭтаФорма.ОбзорHTML = СтрЗаменить(ЭтаФорма.ОбзорHTML, Стр, "");
			Продолжить;		
		КонецЕсли;	
		
		ПутевойЛист = СтрЗаменить(Стр, "&quot;", """"); 
		ДанныеЛиста = "";
		
		ЧтениеJSON = Новый ЧтениеJSON;
		ЧтениеJSON.УстановитьСтроку(ПутевойЛист);
		Попытка
			ДанныеЛиста = ПрочитатьJSON(ЧтениеJSON);
		Исключение
			Продолжить;
		КонецПопытки;
		
		Для Каждого РеквизитЛиста Из ДанныеЛиста Цикл
			ПутевыеЛистыХТМЛ_Тело = ПутевыеЛистыХТМЛ_Тело+РеквизитЛиста.Номер+" от "+Формат(ПрочитатьДатуJSON(РеквизитЛиста.Дата, ФорматДатыJSON.ISO), "ДФ=dd.MM.yyyy")+" ("+РеквизитЛиста.Автомобиль+")<br>";
		КонецЦикла;	
		
		//Уберем видимость дополнительных данных в обзоре
		ЭтаФорма.ОбзорHTML = СтрЗаменить(ЭтаФорма.ОбзорHTML, Стр, "");
	КонецЦикла;	

	ЭтаФорма.ОбзорHTML = Лев(ЭтаФорма.ОбзорHTML, ТочкаВставки-1)+ПутевыеЛистыХТМЛ_Начало+ПутевыеЛистыХТМЛ_Тело+ПутевыеЛистыХТМЛ_Конец+"</table></body></html>";
	
КонецПроцедуры

&НаСервереБезКонтекста
Функция ЭтоКомандировка(ТекущийДокумент)
	
	Если ТипЗнч(ТекущийДокумент) = Тип("СправочникСсылка.ВнутренниеДокументы")
		И ТекущийДокумент.ВидДокумента.Наименование = "Командировка" Тогда
		Возврат Истина;
	Иначе
		Возврат Ложь;
	КонецЕсли;
	
КонецФункции	

&НаКлиенте
Функция ПолучитьДанныеСтроки(Выражение, СтрокаДанных)
	
	//Воспользуемся регулярными выражениями
	//
	//	Левая скобка параметра = <
	//	Правая скобка параметра = >
	//	Шаблон имени = [А-ЯA-Z][-_ А-Яа-я0-9A-Za-z]*?
	
	idPattern = Выражение;
	
	RegExpLocal = Новый COMОбъект("VBScript.RegExp");
	
	RegExpLocal.Multiline = Истина;
	RegExpLocal.Global = Истина;
	RegExpLocal.IgnoreCase = Истина;
	RegExpLocal.Pattern = idPattern;
	
	МассНайдено = Новый Массив;
	Найдено = RegExpLocal.Execute(СтрокаДанных);
	Для каждого Стр Из Найдено Цикл
		
		Начало = Стр.FirstIndex;
		Длина = Стр.Length;
		Значение = Стр.Value;
		
		МассНайдено.Добавить(Значение);
	КонецЦикла;
	Возврат МассНайдено;
	
КонецФункции	



